# GetGridNodeReference Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DividedSurface..::..GetGridNodeReference Method
DividedSurface Class See Also
---
Get a reference to the geometric point associated with a grid node.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Reference GetGridNodeReference(
	GridNode gridNode
)
```

Visual Basic
---
```text
Public Function GetGridNodeReference ( _
	gridNode As GridNode _
) As Reference
```

Visual C++
---
```text
public:
Reference^ GetGridNodeReference(
	GridNode gridNode
)
```

# ### Parameters
gridNode
    Type: Autodesk.Revit.DB..::..GridNode
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | Thrown when the grid node indexes are outside the range [ 0, NumberOfUGridlines - 1 ], [ 0, NumberOfVGridlines - 1 ]. |

# See Also
DividedSurface Class
Autodesk.Revit.DB Namespace